// © Copyright 2004-2007, 2015 HP Development Company, L.P.

TaskName = "Lataa fontit";

OkButtonTitle = "OK";
CancelButtonTitle = "Peruuta";
LoadingStorageDeviceInfoProcessTitle = "Ladataan tallennuslaitteen tietoja…";
LoadingStorageDeviceListProcessTitle = "Ladataan tallennuslaitteiden luetteloa…";
LoadingFontListProcessTitle = "Ladataan fonttiluetteloa…";
SendingFontProcessTitle = "Ladataan fonttia \"%@\"…";
RemovingFontProcessTitle = "Poistetaan fonttia \"%@\"…";
RemoveConfirmationMessage = "Oletko varma, että haluat poistaa valitut fontit tulostimesta?";
RemoveConfirmationMessageExplanation = "Et voi kumota tätä toimenpidettä.";
StorageDeviceLocked = "Tallennuslaite on lukittu";
RemoveFromMemoryMessage = "Fontteja ei voi poistaa laitteen muistista";
RemoveFromMemoryExplanation = "Kaikki esiasennetut fontit ovat vain luku -muotoa. Kaikki käyttäjän lisäämät fontit poistetaan muistista, kun laite käynnistetään uudelleen. Muissa tallennuslaitteissa olevat fontit tallennetaan uudelleenkäynnistyksen aikana, ja ne voidaan poistaa manuaalisesti.";

DiskNameTemplate = "Levy, ID=%@ (Koko: %@)";
FlashNameTemplate = "Flash SIMM, ID=%@ (Koko: %@)";
SizeInBytes = "%.1f tavua";
SizeInKBytes = "%.1f Kt";
SizeInMBytes = "%.1f Mt";
SizeInGBytes = "%.1f Gt";
SizeInTBytes = "%.1f Tt";

// Errors
FileOpenError = "Fonttitiedoston \"%@\" avaus ei onnistu.";
FileOpenErrorExplanation = "Tiedosto on vaurioitunut tai se on muodossa, jota laite ei tue. Valitse jokin toinen fonttitiedosto ja yritä uudelleen.";
FormatError = "Fontin \"%@\" muoto ei ole tunnistettava.";
FormatErrorExplanation = "Valitse jokin toinen fonttitiedosto ja yritä uudelleen.";
SingleUnsupportedError = "Kirjasinta %@ ei tueta.";
SingleUnsupportedErrorExplanation = "Kirjasin ohitetaan.";
MultipleUnsupportedError = "Kirjasimia %@ ei tueta.";
MultipleUnsupportedErrorExplanation = "Kirjasimet ohitetaan.";
SingleAlreadyScheduledError = "Fontti \"%@\" on jo luettelossa.";
SingleAlreadyScheduledErrorExplanation = "Fontti ohitetaan.";
MultipleAlreadyScheduledError = "Kirjasimet %@ ovat jo luettelossa.";
MultipleAlreadyScheduledErrorExplanation = "Kirjasimet ohitetaan.";
SingleAlreadyUploadedError = "Fontti \"%@\" on jo tulostimella.";
SingleAlreadyUploadedErrorExplanation = "Fontti ohitetaan.";
MultipleAlreadyUploadedError = "Kirjasimet %@ ovat jo tulostimessa.";
MultipleAlreadyUploadedErrorExplanation = "Kirjasimet ohitetaan.";
PrintChannelOpenError = "Tulostinkanavan avaus ei onnistu.";
PrintChannelOpenErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Yritä sitten uudelleen.";
DataSendError = "Tietojen lähetys tulostimelle ei onnistu.";
DataSendErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Yritä sitten uudelleen.";
DataReceiveError = "Tietojen vastaanotto tulostimesta ei onnistu.";
DataReceiveErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Yritä sitten uudelleen.";
FontSendError = "Fontin \"%@\" tietoja ei voida lähettää tulostimelle.";
FontSendErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Huomaa, että fonttiluettelon loppuosaa ei ole lähetetty tulostimeen.";
FontRemoveError = "Fontin \"%@\" poisto tulostimesta ei onnistu.";
FontRemoveErrorExplanation = "Varmista, että tulostin on liitetty ja kytketty toimimaan. Huomaa, että fonttiluettelon loppuosaa ei ole poistettu tulostimesta.";
StorageDeviceFullError = "Fontin \"%@\" lataus ei onnistunut, koska tallennuslaite on täynnä.";
StorageDeviceFullErrorExplanation = "Valitse jokin toinen tallennuslaite tai poista käyttämättömiä fontteja ja yritä uudelleen. Huomaa, että fonttiluettelon loppuosaa ei ole ladattu tulostimeen.";
ScriptProcessingError = "Komentosarjaa, jossa on fontti \"%@\", ei voitu käsitellä.";
ScriptProcessingErrorExplanation = "Valitse jokin toinen fontti ja yritä uudelleen. Huomaa, että fonttiluettelon loppuosaa ei ole ladattu tulostimeen.";
DeviceVmError = "Fontin \"%@\" lataus ei onnistunut, koska tulostimen muisti on melkein lopussa.";
DeviceVmErrorExplanation = "Valitse jokin toinen tallennuslaite tai poista käyttämättömiä fontteja ja yritä uudelleen. Huomaa, että fonttiluettelon loppuosaa ei ole ladattu tulostimeen.";

DeviceBusyErrorTitle = "Laite on tällä hetkellä varattu.";
DeviceBusyErrorMessage = "Odota, kunnes laite on saanut tällä hetkellä suoritettavan työn valmiiksi.";

FontNameTemplate = "\"%@\"";

Memory = "Muisti";
UpdateNeeded = "Päivitys tarpeen";

TaskTitle = "Lataa fontit";
TaskDescription = "Valitse tiedosto, jossa tulostinfontit ovat, ja siirrä tiedosto tulostimeen. Siirtämiäsi fontteja voidaan sen jälkeen käyttää tulostustöissä.";
StorageDevices = "Tulostimen fontit:";
UpdateButton = "Päivitä fonttiluettelo";
RemoveButton = "Poista";
AddButton = "Lisää…";
